Melting/test_bi/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    upperWall      
    {
        type            calculated;
        value           $internalField;
    }

    leftWall     
    {
        type            calculated;
        value           $internalField;
    }

    rightWall     
    {
        type            calculated;
        value           $internalField;
    }

    lowerWall     
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
